Repository: giellalt/corpus-sme
Catalog: prestable/tmx/nob2sme/facta/skuvlahistorja1/lind_s.html.tmx
Source language: sme
Languages: nob

source: På norsk
nob: Sámegillii

source: Artihkal girjjis Sámi skuvlahistorjá 1 .
nob: Artikkel i boka Samisk skolehistorie 1 .

source: Girku rolla sámi oahpahusas
nob: Kirkens rolle i samisk opplæring

source: Dalle go Hans Lindkjølen lei Sámi álbmotallaskuvlla rektorin , son lei nu dávjá go vejolaš meahcis ovttas badjeolbmuiguin .
nob: Mens Hans Lindkjølen var rektor ved Den samiske folkehøgskolen var han så ofte som mulig på vidda med reindriftssamer .

source: Dá son lea lávus ovttas Máret Kemiin .
nob: Her er han i lavvoen sammen med Marit Kemi .

source: ( Hans Lindkjølen lea luoikan gova . )
nob: ( Foto utlånt av HL )

source: Hans Lindkjølen lea riegádan Eidskogas Hedmárkkus 1923:s .
nob: Hans Lindkjølen er født i Eidskog i Hedmark i 1923 .

source: Sus lea davviriikkaid gielaid váldofága , etnologiija , pedagogihkka ja kristtalašvuođaoahppu .
nob: Han har nordisk hovedfag , etnologi , pedagogikk og kristendomskunnskap .

source: Son lea bargan Sámi álbmotallaskuvlla oahpaheddjiin ja rektorin Kárášjogas , Romssa sámeskuvlla rektorin , ja vuođđoskuvlla oahpaheddjiin , neavvun ja rektorin Drammenis .
nob: Han har vært lærer og rektor ved Den samiske folkehøgskolen i Karasjok , rektor ved Sameskolen i Troms , samt lærer , rådgiver og rektor i grunnskolen i Drammen .

source: Go sus lei virgelohpi skuvllas , de dutkkai stáhtastipeanddain boarrásut girjjálašvuođa Davvekálohta ja dán guovllu olbmuid birra .
nob: Med permisjon fra skolen hadde han statsstipend for å forske i eldre litteratur om Nordkalotten og dens folk .

source: Lindkjølen lea almmuhan ollu artihkkaliid ja 15 girjji , eatnašat dain leat sámi dilálašvuođaid birra .
nob: Hans Lindkjølen har publisert en rekke artikler og 15 bøker , flertallet av dem handler om samiske forhold .

source: Daid gaskkas leat biografiijat sámi kultuvrra máŋgga ovdamanni birra ja golbma sámiid girjjálašvuođa girjji doložis dálážii : Nordisk saga ( Davviriikkalaš sága ) , Nordkalotten ( Davvikalohtta ) ja Urfolk i Nord ( Eamiálbmogat Davvin ) .
nob: Blant dem er biografier over flere forkjempere for samisk kultur og tre bind om samene i litteraturen gjennom tidene : Nordisk saga , Nordkalotten og Urfolk i Nord .

source: Ovdal álbmotskuvlla áiggi sullii 1740:s doaimmahii girku buot oahpahusa olles Norggas .
nob: Før almueskolens tid omkring 1740 var det kirken som sto for all undervisning i hele Norge .

source: Easka 1790:s bođii gohččun ahte gililávdegottit galget hálddašit skuvla- ja gefiidfuolahusdoaimma .
nob: Først i 1790 kom det påbud om bygdekommisjoner til å styre med skole- og fattigvesenet .

source: Álgo skuvlaoahpahusfálaldagat álbmoga várás álggahuvvojedje Davvi-Møres ja Romsdalas .
nob: De første tilløp til skoleopplæring for almuen kom i gang på Nord-Møre og i Romsdal .

source: Lei álbmotčuvgehusa álggaheaddji , Thomas von Westen , Romsdala Veøya báhppa , gii fidnii guhtta eará boaittobeale guovlluid báhpaid lágidišgoahtit oahpahusa .
nob: Det var ildsjelen for folkeopplysning , Thomas von Westen , prest på Veøy i Romsdal , som fikk med seg seks andre prester i distriktene for å gjøre en innsats .

source: Sii čálle Københámmanii gonagassii ja muitaledje álbmoga diehtemeahttunvuođa birra .
nob: De skrev til kongen i København og fortalte om almuens uvitenhet .

source: Gonagas vástidii reivii positiivvalaččat , ja nu gohčoduvvon Syvstjerneprestene ( Čiežanástebáhpat ) ledje lohkanoahpahusa álggaheaddjit .
nob: Kongen reagerte positivt på henvendelsen , og de såkalte Syvstjerne-prestene ble foregangsmenn for leseopplæring .

source: Ulbmil lei ahte olbmot ieža galge máhttit lohkat Biibala , katekismusa ja eará ipmilbalolaš girjjiid .
nob: Hensikten var at folket selv skulle bli i stand til å lese bibelen , katekismen og andre gudelige bøker .

source: 1769:s sáddii gonagas gohččuma ahte mánát galge konfirmerejuvvot 14-15-jahkásažžan ja maŋimusat 19-jahkásažžan .
nob: I 1759 sendte kongen ut en forordning om at barna skulle konfirmeres i 14-15-årsalderen og senest i 19-årsalderen .

source: Jos galge konfirmerejuvvot , de fertejedje máhttit lohkat girjji .
nob: For å bli konfirmert måtte de kunne lese i bok .

source: Dan eai lean gal buot geafes váhnemiid mánát oahppan .
nob: Det var det ikke alle fattigmannsbarn som hadde lært .

source: Nu garra mearrádusat ledje ahte nuoraid bidje giddagassii dassážii go ledje oahppan lohkat .
nob: Her dukker tragediene opp . Det gikk så langt at ungdom ble plassert i tukthus til de lærte å lese .

source: Sii geat nagodedje báhtarit , masse sosiálalaš árvvu .
nob: De som klarte å rømme under konfirmasjon , mistet sin sosiale status .

source: Verremus lei ahte sii eai beassan náitalit .
nob: Verst var det at de ikke fikk gifte seg .

source: Oalle máŋgasat báhtaredje meahccái ja galbmojedje jámas .
nob: Ikke så få rømte til skogs og frøs ihjel .

source: Dát dáhpáhuvai erenoamážit doaivvuhisvuođas go eai beassan náitalit , go nieiddat fuomášedje ahte ledje mánáláhkai .
nob: Det gjaldt særlig i fortvilelse over ikke å kunne gifte seg , når jentene oppdaget at de var gravide .

source: ( Govva : Josef Halse )
nob: ( Tegning : Josef Halse )

source: Davvi-Norgga skuvladilálašvuohta
nob: Skolesituasjonen i Nord-Norge

source: Jos skuvladilálašvuohta lei váttis Mátta-Norggas , de lei dat ollu váddásat Davvi-Norggas .
nob: Var skolesituasjonen vanskelig i Sør-Norge , var den langt vanskeligere i Nord-Norge .

source: Dáppe ledje golbma álbmoga guđesge sierra giella ja sierra kultuvra ; dážat , sámit ja kveanat .
nob: Her var det tre folkeslag med hvert sitt språk og hver sin kultur ; nordmenn , samer og kvener .

source: Lea oalle vissis ahte sápmelaččat juo ovdal reformašuvnna sihke Ruošša , ja maiddái Ruoŧa / Suoma ja Norgga bealde ledje oahpásmuvvan kristtalašvuhtii , muhto váilevaš čállingiela geažil lei dat unnán cieggan , ja dan lei noaidevuohta mealgadii báidnán .
nob: Mye taler for at samene allerede før reformasjonen såvel fra russisk som fra svensk / finsk og norsk side var kjent med kristendommen , men at den på grunn av manglende skriftspråk var lite befestet og sterkt oppblandet med deres opprinnelige sjamanisme .

source: Ledje kristtalaš miššonearat geat álggos ráhkadedje čállingiela , sihke sámiide ja eará álbmogiiddage .
nob: Det er blant samene , som blant en rekke andre folk , de kristne misjonærer som først utviklet et skriftspråk .

source: Sámegiela geavaheapmi oahpahusas ja sárdnideamis , bohciidahtii Norggas kulturpolitihkalaš riiddu , ja mii ain lagabui 300 jagi lea jámma riiddu bohciidahttán .
nob: Innføringen av samisk språk i undervisning og forkynnelse ga i Norge støtet til en kulturpolitisk strid , som har blusset opp med jevne mellomrom i nærmere 300 år .

source: Sámi girko- ja skuvlahistorjá leat guokte beali seamma áššis .
nob: Den samiske kirke- og skolehistorie er to sider av samme sak .

source: Lei namalassii girku mii badjelasas válddii lágidit oahpahusa Sámis .
nob: Det var nemlig kirken som tok på seg å ordne undervisningen i Sameland .

source: Danin lei báhpaid ja miššonearaid bargun ráhkadit maiddái čállingiela ja almmuhit girjjiid sámegillii .
nob: Dermed ble det også en oppgave for prester og misjonærer å utvikle skriftspråk og gi ut bøker på samisk .

source: Lutheralaš girku gáibádus ahte olbmot galge oahppat Ipmila sáni maiddái iežaset gillii , dagahii ahte miššonearat juo 1600-logus geahččaledje dahkat sámegiela čállingiellan , ja muhtun girjjiid maiddái almmuhedje 1416 Dalle juo dien áigge geahččaledje oažžut Norgga beale sámiid vázzit skuvlla .
nob: Den lutherske kirkens krav om at folk skulle lære Guds ord på sitt eget tungemål gjorde at misjonærer allerede på 1600-tallet prøvde å gjøre samisk til skriftspråk , og noe ble også trykt . [ Den første boka på samisk ble trykt i Sverige i 1619 .

source: 1714:s vuođđudii gonagas Fredrik IV Miššonkollegia Københámmanii , ja álggahii vuolggahusbarggu Finnmárkku sámiid gaskkas .
nob: I 1714 opprettet kong Fredrik IV Misjonskollegiet i København , og ga det i oppdrag å begynne misjonsarbeid blant samene i Finnmark .

source: Dát álggahuvvui Thomas von Westena jođihemiin .
nob: Dette ble satt i gang under Thomas von Westens ledelse .

source: 1716:s son vuođđudii " Seminarium Skolasticum " Troandimii , ja dát šattai skuvllabarggu guovddážin sámiid gaskkas .
nob: I 1716 opprettet han " Seminarium Skolasticum " i Trondheim , og det ble senteret for skolearbeidet blant samene .

source: Thomas von Westen mátkkoštii máŋgii sámi guovlluide skuvllaid álggahit ja girkuid hukset .
nob: Thomas von Westen reiste flere ganger omkring i samiske områder for å sette i gang skoler og få bygget kirker .

source: Son barggai háhkat sámiide Áppesa ja eará oahppogirjjiid sámegillii .
nob: Han gikk inn for å skaffe samene ABC-bok og andre lærebøker på samisk .

source: Su mielbargit jorgaledje máŋga girjji ja osiid Biibalis , muhto dušše Luthera Uhca Katekismus deaddiluvvui 1728:s sámi / dáru duppalteavsttain .
nob: Hans medarbeidere oversatte flere bøker og deler av Bibelen , men bare Luthers Lille katekismus ble trykt i 1728 med dobbelt tekst på samisk / norsk .

source: Bisma Peder Krogh vuostálasttii oppa áigge Thomas von Westena oainnu ahte sápmelaččat galge oažžut oahpahusa eatnigillii .
nob: Biskop Peder Krogh var hele tiden uenig med Thomas von Westen i at samene skulle få opplæring i sitt morsmål .

source: 1723:s lohkagođii Knud Leem sámegiela ja 1725:s sáddii Thomas von Westen su Porsáŋgui ja Lágesvutnii miššonearan .
nob: I 1723 begynte Knud Leem å studere samisk , og i 1725 sendte Thomas von Westen han til Porsanger og Laksefjord som misjonær .

source: 1728:s Leem nammaduvvui suohkanbáhppan Áltái-Dálbmeluktii .
nob: I 1728 ble Leem utnevnt til sokneprest i Alten-Talvik .

source: Miššonbarggu álggu rájes juo Leem háliidii oahppat sámegiela ja sámi jurddašanvuogi .
nob: Helt fra starten av sin misjonsgjerning gikk Leem inn for å leve seg inn i samisk språk og tenkemåte .

source: Son geavahii sámi gárvvuid ja hálai olbmuide iežaset eatnigillii .
nob: Han gikk i samiske klær og snakket til folket på deres morsmål .

source: Go von Westen jámii 1727:s , de bággii bisma Krogh dahkat mearrádusa ahte buot sámemánát galgá oahpahuvvot dáro- / dánskkagillii nu ahte sii sáhtte geavahit dárogiela girjjiid ja oassádallat ipmilbálvalusas ovttas dážaiguin .
nob: Da von Westen døde i 1727 , trummet biskop Krogh igjennom at alle samebarn skulle få sin opplæring på norsk / dansk , slik at de kunne bruke norske bøker og delta i gudstjenester sammen med nordmenn .

source: Seminarium Skolasticum heaittihuvvui , ja miššonearaid gevrejedje oahpahit sámiid dárogillii .
nob: Seminarium Skolasticum ble nedlagt , og misjonærene ble pålagt å undervise samene på norsk .

source: Eai buohkat jeagadan dán gohččuma , ja barge ain von Westena vuoiŋŋas .
nob: Ikke alle fulgte dette påbudet . Noen fortsatte å følge von Westens linje .

source: Láhkavuođustuvvon skuvlavázzin
nob: Lovfestet skolegang

source: Go 1739:s láhkavuođustedje skuvlavázzima buohkaide Norgga boaittobeale guovlluin , de dát gustui maiddái sápmelaččaide , geat lága mielde ožžo seamma vuoigatvuođa ja geatnegasvuođa skuvlavázzimii nugo earátge .
nob: Da det i 1739 ble lovfestet skolegang for alle på landet i Norge , gjaldt det også samene , som etter loven fikk samme rett og plikt til skolegang som andre .

source: Vuosttažettiin dát guoskkai konfirmašuvdnaskuvllaide .
nob: Det dreide seg i første rekke om konfirmasjonsskoler .

source: Gielalaš ja eará kultuvrralaš eavttut leat dattetge sámiide unnitlohkun dahkan váttisin ávkkástallat skuvlavázzima seamma láhkai go eanetlogu álbmot .
nob: Språklige og andre kulturelle forutsetninger har imidlertid helt opp til vår egen tid gjort det vanskelig for samene som minoritet å få samme utbytte av skolegangen som majoriteten .

source: Ođđa bismmat oidne váttisvuođa , ja 1752:s vuođđuduvvui " Seminarium Lapponicum " Troandimii .
nob: Nye biskoper så problemet , og i 1752 ble " Seminarium Lapponicum " opprettet i Trondheim .

source: Dat galggai oahpahit sámegielat miššonearaid ja jorgalit girjjiid sámegillii .
nob: Det skulle utdanne samiskkyndige misjonærer og oversette bøker til samisk .

source: Professortihtteliin nammaduvvui Leem seminára jođiheaddjin .
nob: Med tittel av professor ble Leem utnevnt til bestyrer av seminaret .

source: Son bisui dán barggus gitta jápminbeaivái 1774:s .
nob: Han ble der til sin død i 1774 .

source: 1748:s almmuhii Leem sámegiela giellaoahpu ja 1756:s dánskka-sámegiela sátnegirjji : " En Lappesk Nomenclator efter den Dialect , son bruges av Fjeld-Lapperne i Porsanger-Fjorden " ( Sámi sátnegirji Porsáŋgguvuona boazosámiid dialeavtta mielde ) .
nob: I 1748 ga Leem ut en samisk språklære og i 1756 et dansk-samisk glossar : " En Lappesk Nomenclator efter den Dialect , som bruges af Fjeld-Lapperne i Porsanger-Fjorden " .

source: 1767:s son almmuhii Luthera Uhca Katekismusa ja Áppesa sámegillii .
nob: I 1767 ga han ut Luthers Lille Katekismus og en ABC-bok på samisk .

source: Go Leem jámii 1774:s , lei son measta gárvvistan guokte sátnegirjji .
nob: Da Leem døde i 1774 var han nesten ferdig med en ordbok i to bind .

source: Vuosttaš girji lei sámegielas dánskkagillii ja latiinnagillii , nubbi girji lei dánskkagielas ja latiinnagielas sámegillii .
nob: Første bind var fra samisk til dansk og latin , andre bind var fra dansk og latin til samisk .

source: Girjjiid gárvvistii Várjjaga miššoneara , Gerhard Sandberg , ja dat almmustuvve 1781:s .
nob: Verket ble fullført av misjonær i Varanger , Gerhard Sandberg , og ble utgitt i 1781 .

source: Leem adnojuvvo davvisámegiela čállingiela vuođđudeaddjin .
nob: Leem blir reknet som grunnleggeren av det nordsamiske skriftspråket .

source: Dán áigodagas bohte guokte ođđa bismma Troandimii .
nob: Det kom to nye biskoper til Trondheim på denne tiden .

source: Sii garrasit vuostálaste sámegiela ja heaittihedje seminára 1774:s .
nob: De var sterke motstandere av samisk og la ned seminaret i 1774 .

source: Seamma jagi go seminára heaittihuvvui , de bođii Olav Josephsen Hjort Guovdageidnui suohkanbáhppan .
nob: Samme år som seminaret ble nedlagt , kom Olav Josephsen Hjort til Kautokeino som sokneprest .

source: Oahpahusa ovddasvástideaddjin iežas searvegotti sámiide , oaččui son girku njunnošiin gohččuma ahte galggai buot prentejuvvon sámegiela girjjálašvuođa váldit ruovttoluotta .
nob: Som ansvarlig for opplæringen av samene i sin menighet , ble han av kirkens ledelse pålagt å påse at all litteratur trykt på samisk ble inndratt .

source: Son ii seastán ovttage ja ribadii buot sámegiela girjjiid maid gávnnai .
nob: Uten skånsel gikk han til verket og konfiskerte alt han kom over av samiske trykksaker .

source: Olbmot gohčodedje su buddestatnamain Garra-Jorta .
nob: På folkemunne ble han gående under navnet Harde-Hjort .

source: Jos sámiid lohkangelbbolašvuohta lei headju ovddežis , de dat ii buorránan dán maŋŋá .
nob: Hadde samenes leseferdighet vært dårlig før , så ble den ikke bedre etter dette .

source: Miššonearat ja báhpat váidaledje heađi ja bivde lobi geavahišgoahtit fas sámegiela čuvgehusbarggus .
nob: Misjonærer og prester klaget sin nød og ba om at samisk igjen måtte få sin plass i opplysningsarbeidet .

source: Nuorta-Finnmárkkus lei P. V. Deinboll báhppan ja proavasin 1816:s .
nob: I Øst-Finnmark var P. V. Deinboll prest og prost i 1816 .

source: Son barggai Thomas von Westena vuoiŋŋas ja mátkkoštii miehtá viiddis guovllustis álggahit skuvllaid .
nob: Han tok opp arven etter Thomas von Westen og reiste rundt i sitt vidstrakte distrikt for å få satt i gang skoler .

source: Muhto giellaváttisvuođat ledje áigge heahtin .
nob: Men språkvanskene var hele tiden en hindring .

source: 1826:s duohtanválde heahtečurvosiid .
nob: I 1826 ble nødropene tatt til følge .

source: Dalle álggahuvvui vuosttaš almmolaš oahpaheaiskuvla Norggas Runáššis ( Trondenesa ) .
nob: Da ble den første offentlige lærerskole i Norge startet på Trondenes .

source: Dat galggai erenoamážit bargat oahpahit sámiid ja earáid geat háliidedje bargat davvin sámeguovlluin .
nob: Den tok særlig sikte på å utdanne samer og andre som ville arbeide i sameområdene i nord .

source: Go Suoma-Gárjila álbmot mátta-nuortan báhkkegohte davás , de laskkai sámiid lohku sakka Finnmárkkus áigodagas 1567-1865 , J. A. Friisa dieđuid mielde .
nob: Under påtrykk av den finsk-karelske befolkning i syd-øst økte samenes antall sterkt i Finnmark i tiden 1567-1865 , i følge J. A. Friis .

source: Ruoŧas , Suomas ja Ruoššas geahppánii sápmelaččaid lohku seamma áigodagas .
nob: I Sverige , Finland og Russland avtok antallet samer i samme periode .

source: 1700-logu álggus lei Suoma ja Ruošša gaskasaš soahti giksin .
nob: Begynnelsen av 1700-tallet var sterkt preget av krig mellom Finland og Russland .

source: Suopmelaš álbmot lei dalle nu gefon ahte sii measta buohkat geat sáhtte beahkit ja vázzit , báhtaredje Finnmárkui dahje Davvi-Ruŧŧii .
nob: Det finske folk var da så utarmet at nærmest alle som kunne krype og gå flyktet til Finnmark eller Nord-Sverige .

source: Oktogávperiekti mii Bergena gávpejasain lei ovdavuoigatvuođaid bokte maid sii ledje ožžon dánskalaš ráđđehusas , geahpedii garrasit dáža álbmoga Finnmárkkus .
nob: Monopoltyranniet som bergenskjøpmennene øvet , gjennom privilegier de hadde fått av den danske regjering , reduserte den norske befolkning i Finnmark sterkt .

source: 1845:s ledje álbmotlohkama oktavuođas measta beali eanet sápmelaččat ja kveanat go dážat Finnmárkkus .
nob: I 1845 var det ved folketellingen nesten dobbelt så mange samer og kvener som det var nordmenn i Finnmark .

source: Eatnašiid beaivválašgiella lei sámegiella ja suomagiella .
nob: Samisk og finsk var dagligspråket blant flertallet .

source: Sámemánáin ledje danin stuorra váttisvuođat áddet oahpahusa mii lei dárogillii .
nob: Samebarna hadde derfor store problem med å forstå undervisningen som foregikk på norsk .

source: N. V. Stockfleth áŋgirušai nannet sámegiela , muhto báhppan son lei hui garas , ja Guovdageainstuimmiid maŋŋil son lei daid gaskkas geat gáibidedje garra ráŋggáštusaid .
nob: N. V. Stockfleth gjorde en stor innsats for samisk språk , men som prest var han svært streng og etter Kautokeino-opprøret i 1852 var han blant dem som ivret for strenge straffer .

source: 1825:s mátkkoštii Nils Vibe Stockfleth iežas suohkaniin Várggáin , Čáhcesullos , Unjárggas , Davvesiiddas ja vuollásaš suohkaniin Deanus ja Gilevuonas .
nob: I 1825 reiste presten Nils Vibe Stockfleth omkring i sine sogn Vardø , Vadsø , Nesseby og Lebesby med annekssognene Tana og Kjøllefjord .

source: Son doalai ipmilbálvalusaid ja gallestalai ruovttuid oahpásmuvvan dihtii mánáid lohkangelbbolašvuhtii .
nob: Han holdt gudstjenester og gikk på husbesøk for å få kjennskap til barnas leseferdigheter .

source: Farga fuomášii ahte máŋga ollesolbmo heajos oahpahusa ja girku váilevaš bálvalusaid geažil eai lean konfirmerejuvvon .
nob: Snart oppdaget han at mange voksne på grunn av dårlig undervisning og mangel på kirkelig betjening ikke var konfirmert .

source: Son gávnnahii ahte vaikko sápmelaččat ledje kristtalaččat namas , de geavatlaččat sii ledje bealle báhkinat diidaoskkuset geažil .
nob: Han kom fram til at om samene var kristne i navnet , måtte de i praksis regnes som halvt hedninger med all sin overtro .

source: Son johtilit áddii ahte jos son galggai lihkostuvvat dáiguin olbmuiguin , de fertii oahppat sihke sin giela ja sin eallinvuogi .
nob: Det gikk raskt opp for ham at skulle han oppnå noe blant disse menneskene , måtte han lære både språket og levemåten deres .

source: Stuorra áŋgirvuođain son lohkagođii giela , ja golmmajageáigodagas 1836 ´ rájes son almmuhii Áppesa ja lohkangirjji , Luthera Uhca Katekismusa , biibalhistorjjá oktan oaniduvvon viđain Movssesgirjjiin ja dasa lassin muhtun sálbma- ja rohkosgirjji .
nob: Med stor iver gikk han inn for språkstudiene , og i løpet av en treårsperiode fra 1836 utga han en ABC-bok og en lesebok , Luthers Lille katekismus , en bibelhistorie med en forkortet utgave av de fem Mosebøkene i tillegg til en del salme- og bønnebøker .

source: Ja de velá almmuhii sámegiela grammatihka dárogielagiidda , gaskaboddosaš ođđa testameantta osiid jorgaleami ja dasto velá moadde unnit barggu .
nob: Dessuten fikk han utgitt en samisk grammatikk for norsktalende , en foreløpig oversettelse av deler av Det nye testamente , foruten et par mindre arbeider .

source: 1825 áigodaga rájes Stockfleth váikkuhii dasa ahte sihke girku ja stáhta beroštišgohte eanet sámiin ja sin gielladilálašvuođas .
nob: I tiden fra 1825 bidro Stockfleth til at både kirke og stat fattet større interesse for samene og deres språksituasjon .

source: Cuoŋománu 8. beaivve 1846:s sáddii Stockfleth evttohusa gonagassii ahte báhppastudeanttat berrejedje oahppat sáme- ja suomagiela .
nob: 8. april 1846 sendte Stockfleth en forestilling til kongen om at vordende prester burde lære samisk og finsk .

source: Evttohusa dohkkehii Ráđđehus guovvamánu 12. beaivve 1848 , ja mearriduvvui gonagaslaš resolušuvnna bokte guovvamánu 24. beaivve seamma jagi .
nob: Forslaget ble innstilt av Regjeringen 12. februar 1848 , og vedtatt ved kgl.res. av 24. februar samme år .

source: Stockfleth ieš oahpahii dáid gielaid Christiania universitehtas dassážii go J. A. Friis badjelasas válddii 1851:s .
nob: Stockfleth sto sjøl for undervisningen i disse språk ved universitetet i Christiania til J. A. Friis overtok i 1851 .

source: Muhto Stockflethas ledje vuostálastit .
nob: Men Stockfleth hadde sine motstandere .

source: Okta lei suohkanbáhppa Zetlitz .
nob: Sokneprest Zetlitz var en av dem.

source: Son lei leamaš suohkanbáhppan Čuđegietti ( Kistrand ) báhppasuohkanis 1836 rájes , ja dán báhppasuohkanii gulle measta buot Oarje-Finnmárkku johttisápmelaččat .
nob: Han hadde vært sokneprest i Kistrand prestegjeld fra 1836 , et prestegjeld som omfattet nesten alle flyttsamer i Vest-Finnmark .

source: Su mielas lei lunddolaš ovdáneapmi ahte buot sámit galge suddat dáža álbmogii , ja dán rievdama ii galgan heađuštit .
nob: Han så det som en naturlig utvikling at alle samer ville smelte sammen med nordmennene , og at man ikke måtte legge noen hindring i veien for denne utvikling .

source: Stockfleth stuorámus vuostálasti girkolaččaid gaskkas lei Álttá-Dálbmeluovtta proavás Aars .
nob: Stockfleths argeste motstander blant de geistlige var prost Aars i Alten-Talvik .

source: Finnmárkku stuorradiggeáirrasin 1848:s ja 1851:s son hehttii 1851:s ja 1853:s gonagaslaš giella- ja oahpahusdilálašvuođaid resolušuvnnaid šaddamis nu beaktilin go Stockfleth ja su verddet livčče háliidan .
nob: Som stortingsrepresentant for Finnmark i 1848 og 1851 sørget Aars for at de kongelige resolusjoner om språk- og undervisningssituasjonen fra 1851 og 1853 ikke kom til å gå så langt som Stockfleth og hans meningsfeller hadde ønsket .

source: Proavás Aars vuosttaldii maiddái garrasit aiddo mearriduvvon guovvamánu 1848 gonagaslaš resolušuvnna , mas lei mearriduvvon ahte eiseválddit galge deattuhit sámegiel ´ a ja kveanagiela máhtu go báhpaid virgádedje .
nob: Prost Aars gikk dessuten kraftig ut mot den nylig vedtatte kongelige resolusjon av februar 1848 , der det var vedtatt at det skulle tas hensyn til kunnskaper i samisk og kvensk ved utnevnelse av prester .

source: Jagiid 1841-1843 orui Stockfleth guhkes áigodagaid Guovdageainnus .
nob: I årene 1841-1843 oppholdt Stockfleth seg lange perioder i Kautokeino .

source: Suohkanbáhpa Zetlitz sadjásažžan son jođihii sátnejođiheaddjin vuosttaš skuvlakommišuvnna čoahkkima .
nob: Som stedfortredende ordfører i sokneprest Zetlitz ' fravær ledet han det første møtet i skolekommisjonen .
